1.Создайте программу, которая проверяет, является ли введенное пользователем число четным или нечетным, и выводит соответствующее сообщение.
# ответ

# Запрашиваем у пользователя ввод числа
number = int(input("Введите число: "))

# Проверяем, является ли число четным или нечетным
if number % 2 == 0:
    print(f"Число {number} является четным.")
else:
    print(f"Число {number} является нечетным.")


2.Реализуйте программу, которая определяет, является ли введенная пользователем строка палиндромом (читается одинаково слева направо и справа налево). Выведите соответствующее сообщение.
s
# ответ

# Запрашиваем у пользователя ввод строки
s = input("Введите строку: ")

# Удаляем пробелы и приводим строку к нижнему регистру
cleaned_s = s.replace(" ", "").lower()

# Проверяем, является ли строка палиндромом
if cleaned_s == cleaned_s[::-1]:
    print(f"Строка '{s}' является палиндромом.")
else:
    print(f"Строка '{s}' не является палиндромом.")

3.Реализуйте программу, которая определяет, является ли заданное число простым (имеет только два делителя: 1 и само число). Выведите соответствующее сообщение.
# ответ
# Функция для проверки, является ли число простым
def is_prime(n):
    if n <= 1:  # Числа меньше или равные 1 не являются простыми
        return False
    for i in range(2, int(n**0.5) + 1):  # Проверяем делители от 2 до √n
        if n % i == 0:  # Если n делится на i, то это не простое число
            return False
    return True  # Если не нашли делителей, число простое

# Запрашиваем у пользователя ввод числа
number = int(input("Введите число: "))

# Проверяем, является ли число простым
if is_prime(number):
    print(f"Число {number} является простым.")
else:
    print(f"Число {number} не является простым.")


4.Реализуйте программу, которая определяет, является ли заданная дата корректной (). Выведите соответствующее сообщение.
Дата дана в формате “20.01.2002”
# ответ
from datetime import datetime

# Функция для проверки корректности даты
def is_valid_date(date_str):
    try:
        # Пробуем преобразовать строку в объект даты
        datetime.strptime(date_str, "%d.%m.%Y")
        return True  # Если преобразование прошло успешно, дата корректная
    except ValueError:
        return False  # Если возникла ошибка, дата некорректная

# Запрашиваем у пользователя ввод даты
date_input = input("Введите дату в формате DD.MM.YYYY: ")

# Проверяем, является ли дата корректной
if is_valid_date(date_input):
    print(f"Дата '{date_input}' является корректной.")
else:
    print(f"Дата '{date_input}' не является корректной.")




5.Напишите программу для нахождения всех совершенных чисел (чисел, равных сумме своих делителей, исключая само число) в заданном диапазоне. Диапазон от 0 до 1000
# ответ
def is_perfect_number(n):
    # Считаем сумму делителей числа n, исключая само число
    sum_of_divisors = sum(i for i in range(1, n) if n % i == 0)
    return sum_of_divisors == n  # Проверяем, является ли n совершенным

# Находим все совершенные числа в диапазоне от 0 до 1000
perfect_numbers = [num for num in range(1, 1001) if is_perfect_number(num)]

# Выводим результат
print("Совершенные числа в диапазоне от 0 до 1000:", perfect_numbers)


6.Реализуйте программу для проверки, является ли заданное число числом Фибоначчи (число, которое является членом последовательности Фибоначчи). Заданное число 25
# ответ
def is_fibonacci(n):
    # Начальные значения последовательности Фибоначчи
    a, b = 0, 1
    while a < n:
        a, b = b, a + b  # Генерируем следующее число Фибоначчи
    return a == n  # Проверяем, является ли n числом Фибоначчи

# Заданное число
number = 25

# Проверяем, является ли число Фибоначчи
if is_fibonacci(number):
    print(f"Число {number} является числом Фибоначчи.")
else:
    print(f"Число {number} не является числом Фибоначчи.")


7.Напишите программу, которая определяет, является ли заданное число совершенным числом (число, равное сумме своих делителей, исключая само число). Выведите сообщение с результатом.
# ответ
def is_perfect_number(n):
    if n <= 1:
        return False  # Числа 0 и 1 не являются совершенными
    # Считаем сумму делителей числа n, исключая само число
    sum_of_divisors = sum(i for i in range(1, n) if n % i == 0)
    return sum_of_divisors == n  # Проверяем, является ли n совершенным

# Заданное число
number = int(input("Введите число: "))

# Проверяем, является ли число совершенным
if is_perfect_number(number):
    print(f"Число {number} является совершенным.")
else:
    print(f"Число {number} не является совершенным.")

8.Создайте программу, которая определяет, в какой сезон года попадает заданная дата (месяц и день). 
# ответ
def determine_season(month, day):
    # Определяем сезоны по месяцам и дням
    if (month == 12 and day >= 21) or (month <= 2) or (month == 3 and day < 20):
        return "Зима"
    elif (month == 3 and day >= 20) or (month <= 5) or (month == 6 and day < 21):
        return "Весна"
    elif (month == 6 and day >= 21) or (month <= 8) or (month == 9 and day < 23):
        return "Лето"
    elif (month == 9 and day >= 23) or (month <= 11) or (month == 12 and day < 21):
        return "Осень"
    else:
        return "Некорректная дата"  # Для некорректных значений

# Запрашиваем у пользователя ввод месяца и дня
month = int(input("Введите месяц (1-12): "))
day = int(input("Введите день (1-31): "))

# Проверяем корректность введенной даты (не идеально, но для простоты)
if (month < 1 or month > 12) or (day < 1 or day > 31):
    print("Некорректная дата")
else:
    # Определяем сезон
    season = determine_season(month, day)
    print(f"Дата {day}.{month} попадает в сезон: {season}.")
